usrmgrDotNetProject/usrmgrDotNetProject/Connected Services/CollectShuttleToMx/InterfacesPostTapingCollectShuttleToMx01Impl.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="InterfacesPostTapingCollectShuttleToMx01Impl" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.datacontract.org/2004/07/Mx.Broker.Std.Request.Interface.PostTapingCollectShuttle01" />
      <xs:element name="TapingOutputConveyorNumber">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/Mx.Broker.Std.Request.Interface.PostTapingCollectShuttle01" minOccurs="0" name="request" nillable="true" type="q1:PostTapingCollectShuttleTapingOutputConveyorRequest" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="TapingOutputConveyorNumberResponse">
        <xs:complexType>
          <xs:sequence />
        </xs:complexType>
      </xs:element>
      <xs:element name="MissionStatus">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q2="http://schemas.datacontract.org/2004/07/Mx.Broker.Std.Request.Interface.PostTapingCollectShuttle01" minOccurs="0" name="request" nillable="true" type="q2:PostTapingCollectShuttleMissionStatusRequest" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="MissionStatusResponse">
        <xs:complexType>
          <xs:sequence />
        </xs:complexType>
      </xs:element>
      <xs:element name="ReportRunningMode">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q3="http://schemas.datacontract.org/2004/07/Mx.Broker.Std.Request.Interface.PostTapingCollectShuttle01" minOccurs="0" name="request" nillable="true" type="q3:PostTapingCollectShuttleReportRunningModeRequest" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="ReportRunningModeResponse">
        <xs:complexType>
          <xs:sequence />
        </xs:complexType>
      </xs:element>
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="anyType" nillable="true" type="xs:anyType" />
      <xs:element name="anyURI" nillable="true" type="xs:anyURI" />
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary" />
      <xs:element name="boolean" nillable="true" type="xs:boolean" />
      <xs:element name="byte" nillable="true" type="xs:byte" />
      <xs:element name="dateTime" nillable="true" type="xs:dateTime" />
      <xs:element name="decimal" nillable="true" type="xs:decimal" />
      <xs:element name="double" nillable="true" type="xs:double" />
      <xs:element name="float" nillable="true" type="xs:float" />
      <xs:element name="int" nillable="true" type="xs:int" />
      <xs:element name="long" nillable="true" type="xs:long" />
      <xs:element name="QName" nillable="true" type="xs:QName" />
      <xs:element name="short" nillable="true" type="xs:short" />
      <xs:element name="string" nillable="true" type="xs:string" />
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte" />
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt" />
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong" />
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort" />
      <xs:element name="char" nillable="true" type="tns:char" />
      <xs:simpleType name="char">
        <xs:restriction base="xs:int" />
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration" />
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?" />
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S" />
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S" />
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid" />
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}" />
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName" />
      <xs:attribute name="Id" type="xs:ID" />
      <xs:attribute name="Ref" type="xs:IDREF" />
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.datacontract.org/2004/07/Mx.Broker.Std.Request.Interface.PostTapingCollectShuttle01" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Mx.Broker.Std.Request.Interface.PostTapingCollectShuttle01" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.microsoft.com/2003/10/Serialization/" />
      <xs:complexType name="PostTapingCollectShuttleTapingOutputConveyorRequest">
        <xs:sequence>
          <xs:element minOccurs="0" name="TapingOutputConveyorNumber" type="xs:int" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="PostTapingCollectShuttleTapingOutputConveyorRequest" nillable="true" type="tns:PostTapingCollectShuttleTapingOutputConveyorRequest" />
      <xs:complexType name="PostTapingCollectShuttleMissionStatusRequest">
        <xs:sequence>
          <xs:element minOccurs="0" name="MissionNumber" type="xs:int" />
          <xs:element minOccurs="0" name="MissionStatus" type="tns:PostTapingCollectShuttleMissionStatusType" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="PostTapingCollectShuttleMissionStatusRequest" nillable="true" type="tns:PostTapingCollectShuttleMissionStatusRequest" />
      <xs:simpleType name="PostTapingCollectShuttleMissionStatusType">
        <xs:restriction base="xs:string">
          <xs:enumeration value="Ok">
            <xs:annotation>
              <xs:appinfo>
                <EnumerationValue xmlns="http://schemas.microsoft.com/2003/10/Serialization/">1</EnumerationValue>
              </xs:appinfo>
            </xs:annotation>
          </xs:enumeration>
          <xs:enumeration value="Nok">
            <xs:annotation>
              <xs:appinfo>
                <EnumerationValue xmlns="http://schemas.microsoft.com/2003/10/Serialization/">2</EnumerationValue>
              </xs:appinfo>
            </xs:annotation>
          </xs:enumeration>
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="PostTapingCollectShuttleMissionStatusType" nillable="true" type="tns:PostTapingCollectShuttleMissionStatusType" />
      <xs:complexType name="PostTapingCollectShuttleReportRunningModeRequest">
        <xs:sequence>
          <xs:element minOccurs="0" name="DefaultCode" nillable="true" type="xs:int" />
          <xs:element minOccurs="0" name="DefaultLabel" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="EquipmentCode" type="xs:int" />
          <xs:element minOccurs="0" name="RunningMode" type="tns:PostTapingCollectShuttleRunningModeType" />
          <xs:element minOccurs="0" name="RunningModeDateTime" type="xs:dateTime" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="PostTapingCollectShuttleReportRunningModeRequest" nillable="true" type="tns:PostTapingCollectShuttleReportRunningModeRequest" />
      <xs:simpleType name="PostTapingCollectShuttleRunningModeType">
        <xs:restriction base="xs:string">
          <xs:enumeration value="Manual">
            <xs:annotation>
              <xs:appinfo>
                <EnumerationValue xmlns="http://schemas.microsoft.com/2003/10/Serialization/">1</EnumerationValue>
              </xs:appinfo>
            </xs:annotation>
          </xs:enumeration>
          <xs:enumeration value="Rest">
            <xs:annotation>
              <xs:appinfo>
                <EnumerationValue xmlns="http://schemas.microsoft.com/2003/10/Serialization/">2</EnumerationValue>
              </xs:appinfo>
            </xs:annotation>
          </xs:enumeration>
          <xs:enumeration value="MissionInProgress">
            <xs:annotation>
              <xs:appinfo>
                <EnumerationValue xmlns="http://schemas.microsoft.com/2003/10/Serialization/">3</EnumerationValue>
              </xs:appinfo>
            </xs:annotation>
          </xs:enumeration>
          <xs:enumeration value="Default">
            <xs:annotation>
              <xs:appinfo>
                <EnumerationValue xmlns="http://schemas.microsoft.com/2003/10/Serialization/">4</EnumerationValue>
              </xs:appinfo>
            </xs:annotation>
          </xs:enumeration>
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="PostTapingCollectShuttleRunningModeType" nillable="true" type="tns:PostTapingCollectShuttleRunningModeType" />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="IInterfacesPostTapingCollectShuttleToMx01_TapingOutputConveyorNumber_InputMessage">
    <wsdl:part name="parameters" element="tns:TapingOutputConveyorNumber" />
  </wsdl:message>
  <wsdl:message name="IInterfacesPostTapingCollectShuttleToMx01_TapingOutputConveyorNumber_OutputMessage">
    <wsdl:part name="parameters" element="tns:TapingOutputConveyorNumberResponse" />
  </wsdl:message>
  <wsdl:message name="IInterfacesPostTapingCollectShuttleToMx01_MissionStatus_InputMessage">
    <wsdl:part name="parameters" element="tns:MissionStatus" />
  </wsdl:message>
  <wsdl:message name="IInterfacesPostTapingCollectShuttleToMx01_MissionStatus_OutputMessage">
    <wsdl:part name="parameters" element="tns:MissionStatusResponse" />
  </wsdl:message>
  <wsdl:message name="IInterfacesPostTapingCollectShuttleToMx01_ReportRunningMode_InputMessage">
    <wsdl:part name="parameters" element="tns:ReportRunningMode" />
  </wsdl:message>
  <wsdl:message name="IInterfacesPostTapingCollectShuttleToMx01_ReportRunningMode_OutputMessage">
    <wsdl:part name="parameters" element="tns:ReportRunningModeResponse" />
  </wsdl:message>
  <wsdl:portType name="IInterfacesPostTapingCollectShuttleToMx01">
    <wsdl:operation name="TapingOutputConveyorNumber">
      <wsdl:input wsaw:Action="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/TapingOutputConveyorNumber" message="tns:IInterfacesPostTapingCollectShuttleToMx01_TapingOutputConveyorNumber_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/TapingOutputConveyorNumberResponse" message="tns:IInterfacesPostTapingCollectShuttleToMx01_TapingOutputConveyorNumber_OutputMessage" />
    </wsdl:operation>
    <wsdl:operation name="MissionStatus">
      <wsdl:input wsaw:Action="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/MissionStatus" message="tns:IInterfacesPostTapingCollectShuttleToMx01_MissionStatus_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/MissionStatusResponse" message="tns:IInterfacesPostTapingCollectShuttleToMx01_MissionStatus_OutputMessage" />
    </wsdl:operation>
    <wsdl:operation name="ReportRunningMode">
      <wsdl:input wsaw:Action="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/ReportRunningMode" message="tns:IInterfacesPostTapingCollectShuttleToMx01_ReportRunningMode_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/ReportRunningModeResponse" message="tns:IInterfacesPostTapingCollectShuttleToMx01_ReportRunningMode_OutputMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_IInterfacesPostTapingCollectShuttleToMx01" type="tns:IInterfacesPostTapingCollectShuttleToMx01">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="TapingOutputConveyorNumber">
      <soap:operation soapAction="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/TapingOutputConveyorNumber" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="MissionStatus">
      <soap:operation soapAction="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/MissionStatus" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="ReportRunningMode">
      <soap:operation soapAction="http://tempuri.org/IInterfacesPostTapingCollectShuttleToMx01/ReportRunningMode" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="InterfacesPostTapingCollectShuttleToMx01Impl">
    <wsdl:port name="BasicHttpBinding_IInterfacesPostTapingCollectShuttleToMx01" binding="tns:BasicHttpBinding_IInterfacesPostTapingCollectShuttleToMx01">
      <soap:address location="http://wstest-gl.groupeliebot.fr/Mx.Broker.Lima.Endpoint/Interface/InterfacesPostTapingCollectShuttleToMx0101.svc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>