DLL_Lima/ConsoleApplication1/BasicHttpBinding_USCOREIInterfacesPostTapingCollectShuttleToMx01.MissionStatus.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns2="http://schemas.microsoft.com/2003/10/Serialization/"
    xmlns:ns3="http://schemas.datacontract.org/2004/07/Mx.Broker.Std.Request.Interface.PostTapingCollectShuttle01"
    xmlns:ns1="http://tempuri.org/">
 <SOAP-ENV:Body>
   <ns1:MissionStatus>
    <ns1:request>
     <!-- extensibility element(s) -->
     <ns3:MissionNumber>0</ns3:MissionNumber>
     <ns3:MissionStatus>Ok</ns3:MissionStatus>
    </ns1:request>
   </ns1:MissionStatus>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
